/*
 * Copyright(c)2019,硬件研发部
 * All right reseved
 *
 * 文件名称: A5_Com1ProtocolLayer.h
 * 版本号  : V1.0
 * 文件标识:
 * 文件描述: 本文件为
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-09-9, by LXF 创建本文件
 *
 */
 
#ifndef A5_COM1PROTOCOLLAYER_H
#define A5_COM1PROTOCOLLAYER_H

//-----常量定义----------------------------------------------------------------
#define TASK_A5COM1_STK_SIZE                  400
#define TASK_A5COM1_PRIO                       10
#define TASK_A5COM1_ID                         10

//-----结构定义----------------------------------------------------------------

//-----外部变量----------------------------------------------------------------

//-----外部函数----------------------------------------------------------------
void TaskA5_Com1Function(void *pdata);
void A5_SendToA5Data(uint8 *ptr, uint16 usLen);
#endif



























