/*****************************************************************************
* @FileName: iap.c
* @Engineer: TenYan
* @version   V1.0
* @Date:     2020-01-16
* @brief     本文件为IAP功能模块远程固件升级处理的文件
******************************************************************************/

/******************************************************************************
* Includes
******************************************************************************/
#include "IAP.h"
#include "config.h"


/******************************************************************************
 *   Macros
 ******************************************************************************/
#define APP_VERSION_SIGN    "/cache/helloworld_bak_ver.txt"

/******************************************************************************
* Data Types and Globals
******************************************************************************/
uint8_t app_version[5];  // 4G模块应用程序版本号

/*****************************************************************************
 * 
******************************************************************************/
uint8_t IAP_Main(void)
{
  char cmd_buf[128] = {0};

  memcpy(app_version, &rfu_context.file_name[rfu_context.file_name_length-3], 3); // 获取版本号最后面3个数字

  system("cp -f /data/helloworld_bak /cache/helloworld_bak ");
  system("chmod a+x /cache/helloworld_bak");

  sprintf(cmd_buf, "echo %s > %s", app_version, APP_VERSION_SIGN);
  system(cmd_buf);
  system("sync");

  PcDebug_SendString("IAP Reboot");
  sleep(2);
  system("reboot");  // 4G模块重启
  exit(0);

  return 1;
}

//-----文件IAP.c结束---------------------------------------------
