/*
 * Copyright(c)2019, 硬件研发部
 * All right reserved
 *
 * 文件名称: A5Uart0_MCU.h
 * 版本号  : V1.0
 * 文件标识: 
 * 文件描述: 本文件为A5Uart0_MCU功能模块协议层的头文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-05-11, by lxf, 创建本文件
 *
 */

#ifndef _A5UART0_MCU_H
#define _A5UART0_MCU_H

//-----常量定义----------------------------------------------------------------

#define DEV_TTYS4_UART0      "/dev/ttyHS3"


//-----结构定义----------------------------------------------------------------

//-----外部变量----------------------------------------------------------------

//-----外部函数----------------------------------------------------------------

void* pthread_A5Uart0_Function(void* data);
//void A5Uart0_TimingSendClock(void);
void A5Uart0_DataSend(uint8 ucCommand, uint16 uslen, uint8* pdata,uint8 ucSN);
uint16 A5_UART0_Write(uint8 *data, uint16 Len);

#endif
