/*
 * Copyright(c)2020, 江苏徐工信息技术股份有限公司-智能硬件事业部
 * All right reserved 
 * 
 * 文件名称: CollectCompositelayer.h
 * 版本号  : V1.0
 * 文件标识: 
 * 文件描述: 本文件为采集功能模块综合层实现的头文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-14, by, 创建本文件
 *
 */

#ifndef CollectCompositelayer_H
#define CollectCompositelayer_H

//----常量宏定义---------------------------------------------------------------


//-----外部函数定义------------------------------------------------------------

void Task10ms(void);
void SwitchInit(void);
void WorkingTimeInit(void);


#endif


























