/*
 * Copyright(c)2019, 硬件研发部
 * All right reserved
 *
 * 文件名称: GpsDataCalc.c
 * 版本号  : V1.0
 * 文件标识: 
 * 文件描述: GPS模块数据二次加工计算接口实现文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-13, by , 创建本文件
 *
 */
#include "config.h"
#include "GpsModule.h"
#include "GpsDataCalc.h"
#include "GpsModule.h" 

//-----外部变量定义------------------------------------------------------------

//-----内部变量定义------------------------------------------------------------

//-----内部函数声明------------------------------------------------------------

//-----外部函数定义------------------------------------------------------------

/******************************************************************************
** 函数名称: CalceSpeed
** 功能描述: 计算设备的运行速度函数
** 
** 输    入: pucStr,速度域地址
** 输    出: 无
** 返    回: 速度数值
**
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint16 CalcSpeed(uint8 *pucStr)
{
    static uint16  s_usSpeedQueue[SPEEDQUEUEDEPTH] = {0};  //速度循环队列
	static uint8   s_ucCirPtr = 0;                         //速度队列指针
		
	uint8   i = 0;
	uint16  usSpeed = 0;

    //海里/小时
    usSpeed = DecToUint16(pucStr, 3);

	//如果速度值异常,直接丢弃,正常则存入速度队列
	if(usSpeed < SPEEDOVER)
	{
	    s_usSpeedQueue[s_ucCirPtr++] = usSpeed;
		if(s_ucCirPtr == SPEEDQUEUEDEPTH)
		{
		    s_ucCirPtr = 0;
		}
		
	}

	//求平均速度，忽略速度队列满之前的误差
	usSpeed = 0;
	for(i=0; i<SPEEDQUEUEDEPTH; i++)
	{
	    usSpeed += s_usSpeedQueue[i];
	}
	return usSpeed/SPEEDQUEUEDEPTH;
	
}

/******************************************************************************
** 函数名称: CalcLatitude
** 功能描述: 计算设备所处地理纬度
**
** 输    入: pucStr,纬度域地址; ucLength,纬度域长度; ucFlag,南北纬标识
** 输    出: 无
** 返    回: 纬度数值
**
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint32 CalcLatitude(uint8 *pucStr, uint8 ucFlag)
{
    uint32   uiLatitude = 0;
	ucFlag = ucFlag;
	
    uiLatitude = ((uint32)DecToUint16(pucStr,2)*60 + DecToUint16(pucStr+2,2))*1000
		      + DecToUint16(pucStr+5,3);

    return uiLatitude;

}

/******************************************************************************
** 函数名称: CalcLongitude
** 功能描述: 计算设备所处地理经度
** 
** 输    入: pucStr,经度域地址; ucLength,经度域长度; ucFlag,东西经标识
** 输    出:
** 返    回:
**
** 作    者:
** 日    期:2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint32 CalcLongitude(uint8 *pucStr, uint8 ucFlag)
{
    uint32 uiLongitude = 0;
	ucFlag = ucFlag;

    uiLongitude = ((uint32)DecToUint16(pucStr,3)*60 + DecToUint16(pucStr+3,2))*1000
		      + DecToUint16(pucStr+6,3);

	return uiLongitude;
}

/******************************************************************************
** 函数名称: CalcHeight
** 功能描述: 计算设备海拔高度
**
** 输    入: pucStr,海拔域地址; ucLength,海拔域长度
** 输    出: 无
** 返    回: 海拔数值
**
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
int16 CalcHeight(uint8 *pucStr, uint8 ucLength)
{
    if(ucLength>=1)
	{
	    if(pucStr[0]=='-')
		{
		    return (0-DecToUint16(&pucStr[1], ucLength-1));
		}
		return DecToUint16(&pucStr[0], ucLength);
	}
	return 0;
}

/******************************************************************************
** 函数名称: CalcDirect
** 功能描述: 计算方向角
**
** 输    入: pucStr,方向角域地址
** 输    出: 无
** 返    回: 方向角值
**
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint16 CalcDirect(uint8 *pucStr)
{
    return atoi((char*)pucStr)/2;
}

/******************************************************************************
** 函数名称: CalcSatellite
** 功能描述: 计算定位卫星的个数
**
** 输    入: pucStr,卫星个数域地址
** 输    出: 无
** 返    回: 卫星个数值
**
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 CalcSatellite(uint8 *pucStr)
{
    uint8  ucValue;
    ucValue = atoi((char*)pucStr);
	return ucValue<15 ? ucValue : 15;	
}

/******************************************************************************
** 函数名称: CalcDateTime
** 功能描述: 计算日期时间
**
** 输    入: pucDate,日期域地址; pucTime,时间域地址
** 输    出: pstuDT, 保存日期时间的结构体
** 返    回: 无
** 
** 作    者: 
** 日    期: 2011-03-26
**-----------------------------------------------------------------------------
*******************************************************************************/
void CalcDateTime(uint8 *pucDate, uint8 *pucTime, PSTU_Date pstuDT)
{
    //转化日期
    pstuDT->ucDay = DecToUint8(pucDate, 2);
	pstuDT->ucMon = DecToUint8(&pucDate[2], 2);
	pstuDT->ucYear = DecToUint8(&pucDate[4], 2);

    //转化时间
	pstuDT->ucHour = DecToUint8(pucTime, 2);
	pstuDT->ucMin  = DecToUint8(&pucTime[2], 2);
	pstuDT->ucSec  = DecToUint8(&pucTime[4], 2);
	
}

/******************************************************************************
** 函数名称: CalcPosition
** 功能描述: 计算方位函数
**
** 输    入: ucLon,东西经标识; ucLat,南北纬标识
** 输    出: 无
** 返    回: 经纬度方向值:0,西南;1,西北;2,东南;3,东北
**
** 作    者: 
** 日    期: 2011-10-26
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 CalcPosition(uint8 ucLon, uint8 ucLat)
{
    switch(ucLon)
	{
	    case 'E':
			switch(ucLat)
			{
			    case 'N':
					return 3;
				case 'S':
					return 2;
				default:
					return 0xFF;
			}
			break;
			
		case 'W':
			switch(ucLat)
			{
			    case 'N':
					return 1;
				case 'S':
					return 0;
				default:
					return 0xFF;
			}
			break;
			
		default:
			return 0xFF;
	}
}


//-----内部函数定义------------------------------------------------------------


//-----文件GpsDataCalc.c结束---------------------------------------------------





