/*
 * Copyright(c)2019, 硬件研发部
 * All right reserved 
 * 
 * 文件名称: GpsIntegrateLayer.h
 * 版本号  : V1.0
 * 文件标识: 
 * 文件描述: 本文件为GPS功能模块综合层实现的头文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-21, by  创建本文件
 *
 */

#ifndef GPSINTEGRATELAYER_H_20110321_D772D8D8_99C2_4B9E_BEA9_5C16C8C630FB
#define GPSINTEGRATELAYER_H_20110321_D772D8D8_99C2_4B9E_BEA9_5C16C8C630FB

//-----常量定义----------------------------------------------------------------
#define RECVERRORCOUNTER          5
#define PARAERRORCOUNTER          3
#define ANTENNAERRORCOUNTER       10
#define ANTENNAOKCOUNTER          10
#define OVERSPEED                 60

//-----结构定义----------------------------------------------------------------

//-----外部变量----------------------------------------------------------------
extern   STU_Orient m_stuOrient;


//-----外部函数----------------------------------------------------------------

#endif


























