/*
 * Copyright(c)2019, 硬件研发部
 * All right reserved
 *
 * 文件名称: GpsInterfaceLayer.c
 * 版本号  : V1.0
 * 文件标识:
 * 文件描述: 本文件为GPS功能模块接口层的实现文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-21, by  创建本文件
 *
 */
#include "config.h"
#include "GpsModule.h"
#include "GpsHardWareLayer.h"
#include "GpsIntegrateLayer.h" 
#include "GpsInterfaceLayer.h"
#include "GpsProtocolLayer.h"

//-----外部变量定义------------------------------------------------------------
extern  STU_Gps GPS;
//-----内部变量定义------------------------------------------------------------
uint16  m_usGpsDly;       //GPS模块挂起时间
uint32  m_uiDistance;     //里程值

//-----内部函数声明------------------------------------------------------------

static void InitGpsModule(void);
//static void InitDistance(void);

//-----外部函数定义------------------------------------------------------------


//gps复位重新初始化设置
void SetGps(void)
{
	uint8 gpgga1[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x2A};
	uint8 gpgga2[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x38};
	uint8 gpgga3[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x05,0x00,0x00,0x00,0x00,0x00,0x00,0x04,0x46};
	uint8 gpgga4[11] = {0xB5,0x06,0x17,0x04,0x00,0x00,0x23,0x0C,0x03,0x53,0x6D};
	OSTimeDly(100);
  	//SendUart2Data(gpgga1,16);
  	WriteGpsUartData(gpgga1,16);
	OSTimeDly(4);
    //SendUart2Data(gpgga2,16);
    WriteGpsUartData(gpgga2,16);
	OSTimeDly(4);
	//SendUart2Data(gpgga3,16);
	WriteGpsUartData(gpgga3,16);
	OSTimeDly(4);
	//SendUart2Data(gpgga4,11);
	WriteGpsUartData(gpgga4,11);
	return;
	
}


/*********************************************************************************************************
** 函数名称: GPSRMCGGA
** 功能描述: GPS模块只送出GGA,RMC数据 
** 输　     入: 无
**
** 输　     出: 无
** 全局变量: 
** 调用模块: 
**
** 作　     者: 
** 日　     期: 2011年12月30日
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void GPSRMCGGA(void)
{	uint8 gpgga1[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x2A};
	uint8 gpgga2[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x38};
	uint8 gpgga3[16] = {0xB5,0x62,0x06,0x01,0x08,0x00,0xF0,0x05,0x00,0x00,0x00,0x00,0x00,0x00,0x04,0x46};
	//uint8 gpgga4[12] = {0xB5,0x62,0x06,0x17,0x04,0x00,0x00,0x23,0x0C,0x03,0x53,0x6D};
	uint8 gpgga5[44] = {0xB5,0x62,0x06,0x24,0x24,0x00,0xFF,0xFF,0x04,0x02,0x00,
		                0x00,0x00,0x00,0x10,0x27,0x00,0x00,0x05,0x00,0x64,0x00,
		                0x64,0x00,0x32,0x00,0x32,0x00,0x64,0x00,0x00,0x00,0x00,
		                0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1E,0x20};
    OSTimeDly(OS_TICKS_PER_SEC/2);                                                                                         //时, 设为0 , 即无超时控制.
	WriteGpsUartData(gpgga1,16);
	 OSTimeDly(OS_TICKS_PER_SEC/10);
    WriteGpsUartData(gpgga2,16);
	 OSTimeDly(OS_TICKS_PER_SEC/10);
	WriteGpsUartData(gpgga3,16);
	 OSTimeDly(OS_TICKS_PER_SEC/10);
	WriteGpsUartData(gpgga5,44);
}

/******************************************************************************
** 函数名称: InitGps
** 功能描述: 初始化GPS模块
** 
** 输    入: pPara,GPS模块所需参数构成的结构体;uiBps,串口2的波特率
** 输    出: 无
** 返    回: 无
**
** 作    者: 
** 日    期: 2011-03-29
**-----------------------------------------------------------------------------
*******************************************************************************/
void InitGps(uint32 uiBps)
{
	GPS_Uart_Init();
	//GPS_GPIO_Pin_Init();
	InitGpsModule();
//	InitDistance();
	GPSRMCGGA();
	OSTimeDly(OS_TICKS_PER_SEC*2);
	PC_SendDebugData((uint8 *)("GpsInit"), 7, DEBUG_ANYDATA);

}

void ReInitGps(void)	//gps重新初始化
{
	static uint8 cnt = 0;
	
	if(GPS.modelFlag&BIT(0))		//GPS复位了
	{
		if(cnt++ > 10)
		{
    		GPS.modelFlag &= ~BIT(0);
			cnt = 0;
			GPSRMCGGA();
			OSTimeDly(OS_TICKS_PER_SEC*2);
			PC_SendDebugData((uint8 *)("GpsReCfg"), 8, DEBUG_ANYDATA);
		}
		
	}
	else
		cnt = 0;
}

/******************************************************************************
** 函数名称: GPS_SetDistance
** 功能描述: 里程设置函数
**
** 输    入: 待设置里程值
** 输    出: 无
** 返    回: 无
** 
** 作    者: 
** 日    期: 2011-07-29
-------------------------------------------------------------------------------
*******************************************************************************/
void GPS_SetDistance(uint32 uiDistance)
{
 //	m_uiDistance = uiDistance;
//	SaveDistanceToEEPROM(uiDistance);
//SaveDistanceToRTCRAM(uiDistance);
}

/******************************************************************************
** 函数名称: GPS_GetOrient
** 功能描述: 返回GPS模块数据结构
**
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块数据结构
**
** 作    者: 	
** 日    期: 2011-03-22
**-----------------------------------------------------------------------------
*******************************************************************************/
PSTU_Orient GPS_GetOrient(void)
{
    return &m_stuOrient;
}

/******************************************************************************
** 函数名称: GPS_GetLongitude
** 功能描述: 获取当前的经度,单位百万分之一度
** 输    入:
** 输    出: 无
** 返    回: 当前的经度
** 作    者: hhm
** 日    期: 2016-07-01
**-----------------------------------------------------------------------------
*******************************************************************************/
uint32 GPS_GetLongitude(void)
{
    return m_stuOrient.lLongitude_PPMDegree;
}

/******************************************************************************
** 函数名称: GPS_GetLatitude
** 功能描述: 获取当前的纬度,单位百万分之一度
** 输    入:
** 输    出: 当前的纬度
** 返    回: 无
** 作    者: hhm
** 日    期: 2016-07-01
**-----------------------------------------------------------------------------
*******************************************************************************/
uint32 GPS_GetLatitude(void)
{
    return m_stuOrient.lLatitude_PPMDegree;
}

/******************************************************************************
** 函数名称: GPS_GetLatitudeHemisphere
** 功能描述: 获取当前的经度半球,东西经
** 输    入:
** 输    出: 当前的经度半球,1=东经， 0=西经
** 返    回: 无
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetLongitudeHemisphere(void)
{
    return (m_stuOrient.ucPostion & BIT(0))?1:0;
}

/******************************************************************************
** 函数名称: GPS_GetLatitudeHemisphere
** 功能描述: 获取当前的纬度半球,南北纬
** 输    入:
** 输    出: 当前的纬度半球,1=北纬， 0=南纬
** 返    回: 无
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetLatitudeHemisphere(void)
{
    return (m_stuOrient.ucPostion & BIT(1))?1:0;
}

/******************************************************************************
** 函数名称: GetLatitude_Original
** 功能描述: 获取当前原始的纬度数据
** 输    入:
** 输    出: 无
** 返    回: 指向原始纬度数据的指针
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 *GPS_GetLatitude_Original()
{
	return GPS.NMEAdata.Latitude;
}

/******************************************************************************
** 函数名称: GetLatitude_Original
** 功能描述: 获取当前原始的经度数据
** 输    入:
** 输    出: 无
** 返    回: 指向原始经度数据的指针
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 *GPS_GetLongitude_Original()
{
	return GPS.NMEAdata.Longitude;
}

/******************************************************************************
** 函数名称: GPS_GetForDirect
** 功能描述: 获取GPS方向角
** 输    入: 无
** 输    出: 无
** 返    回: GPS方向角
** 作    者: hhm
** 日    期: 2016-7-1
*******************************************************************************/
uint16 GPS_GetForDirect(void)
{
    return m_stuOrient.usForDirect;
}

/******************************************************************************
** 函数名称: GPS_GetHeight
** 功能描述: 获取GPS高度,单位:m
** 输    入: 无
** 输    出: 无
** 返    回: GPS高度
** 作    者: hhm
** 日    期: 2016-7-1
*******************************************************************************/
int16 GPS_GetHeight(void)
{
    return m_stuOrient.sHeight;
}
/******************************************************************************
** 函数名称: GPS_GetSpeed
** 功能描述: 获取设备运行速度
** 输    入: 无
** 输    出: 无
** 返    回: 设备运行速度
** 作    者: hhm
** 日    期: 2016-7-1
*******************************************************************************/
uint16 GPS_GetSpeed(void)
{
    return m_stuOrient.usSpeed;
}

/******************************************************************************
** 函数名称: GPS_GetDistance
** 功能描述: 获取设备运行里程
**
** 输    入: 无
** 输    出: 无
** 返    回: 设备运行里程
**
** 作    者: 
** 日    期: 2011-03-22
**-----------------------------------------------------------------------------
*******************************************************************************/
uint32 GPS_GetDistance(void)
{
	return m_uiDistance;
}

/******************************************************************************
** 函数名称: GPS_GetState
** 功能描述: 获取GPS模块及天线状态
**
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块及天线状态
**
** 作    者: 
** 日    期: 2011-03-22
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetState(void)
{
    return m_stuOrient.ucGpsState;
}

/******************************************************************************
** 函数名称: GPS_GetGpsState
** 功能描述: 获取GPS模块状态
**
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块状态,1异常;0正常
**
** 作    者: 
** 日    期: 2011-07-07
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetGpsState(void)
{
    return m_stuOrient.ucGpsState&BIT(6) ? 1:0;
}

/******************************************************************************
** 函数名称: GPS_GetAnteState
** 功能描述: 获取GPS模块天线状态
**
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块天线状态,0正常;1异常
**
** 作    者: 
** 日    期: 2011-07-07
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetAnteState(void)
{
    return m_stuOrient.ucGpsState&BIT(0) ? 1 : 0;
}

/******************************************************************************
** 函数名称: GPS_GetOrientState
** 功能描述: 获取GPS模块定位状态
** 输    入: 无
** 输    出: 无
** 返    回: GPS定位状态,1=定位;0=未定位
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetOrientState(void)
{
    return m_stuOrient.ucGpsState&BIT(1) ? 1 : 0;
}

/******************************************************************************
** 函数名称: GPS_GetSatellitenums
** 功能描述: 获取GPS星数
** 输    入: 无
** 输    出: 无
** 返    回: GPS星数
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetSatellitenums(void)
{
    return m_stuOrient.satellitenums;
}
/******************************************************************************
** 函数名称: GPS_GetSpeedoverState
** 功能描述: 获取GPS超速状态
** 输    入: 无
** 输    出: 无
** 返    回: GPS超速状态,1=超速;0=正常
** 作    者: hhm
** 日    期: 2016-07-06
**-----------------------------------------------------------------------------
*******************************************************************************/
uint8 GPS_GetSpeedoverState(void)
{
    return m_stuOrient.ucGpsState&BIT(7) ? 1 : 0;
}
/******************************************************************************
** 函数名称: GPS_GetUtcTime
** 功能描述: 获取GPS模块输出的UTC时间
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块输出的UTC时间
** 作    者: hhm
** 日    期: 2015-9-7
**-----------------------------------------------------------------------------
*******************************************************************************/
STU_Date GPS_GetUtcTime()
{
	return m_stuOrient.stuDate;
}


/******************************************************************************
** 函数名称: GPS_GetUtcTime
** 功能描述: 获取GPS模块输出的UTC时间
** 输    入: 无
** 输    出: 无
** 返    回: GPS模块输出的UTC时间
** 作    者: hhm
** 日    期: 2015-9-7
**-----------------------------------------------------------------------------
*******************************************************************************/
STU_Date GPS_GetBeiJinTime()
{
	STU_Date date;
	
	UtcToBjTime(&m_stuOrient.stuDate, &date);
	return date;
}
/******************************************************************************
** 函数名称: GPS_SleepGps()
** 功能描述: GPS模块休眠函数
**
** 输    入: 无
** 输    出: 无
** 返    回: 无
** 
** 作    者: 
** 日    期: 2011-03-22
**-----------------------------------------------------------------------------
*******************************************************************************/
void GPS_SleepGps(void)
{
    GPS.SleepState = 1;  

	OSTimeDly(100);
	GpsPower_CLR();

}

/******************************************************************************
** 函数名称: GPS_WakeGps
** 功能描述: GPS模块唤醒函数
**
** 输    入: 无
** 输    出: 无
** 返    回: 无
** 
** 作    者: 
** 日    期: 2011-03-22
**-----------------------------------------------------------------------------
*******************************************************************************/
void GPS_WakeGps(void)
{
   // GPS_Uart_Init();
	//GPS_GPIO_Pin_Init();
    GpsPower_SET();

	m_usGpsDly = 200*5;         //5秒挂起时间

	GPSRMCGGA();
	GPS.SleepState = 0; 
	PC_SendDebugData((uint8 *)("GpsWk"), 5, DEBUG_ANYDATA);
}

//-----内部函数实现------------------------------------------------------------



/******************************************************************************
** 函数名称: InitGpsModule
** 功能描述: 初始化GPS模块,给GPS模块上电
** 
** 输    入: 无
** 输    出: 无
** 返    回: 无
** 
** 作    者: 
** 日    期: 2011-03-29
**-----------------------------------------------------------------------------
*******************************************************************************/
void InitGpsModule(void)
{
	GPS.RecvTimeOut = GPS_RECEIVE_DATAOUT;  
	m_stuOrient.ucGpsState = 0x41;    //初始化天线及模块状态
    GpsPower_SET();
	OSTimeDly(50);    //

	OSTimeDly(50);    //

}

/******************************************************************************
** 函数名称: InitDistance
** 功能描述: 初始化里程存储区
**
** 输    入: 无
** 输    出: 无
** 返    回: 无
**
** 作    者: 
** 日    期: 2011-07-29
**-----------------------------------------------------------------------------
*******************************************************************************/
#if 0
void InitDistance(void)
{
  //  uint8   aucTemp[6];       

}
//保存里程到RTC RAM里
void SaveDistanceToRTCRAM(uint32 uiDistance)
{

}

void SaveDistanceToEEPROM(uint32 uiDistance)
{
	//uint8 aucTemp[6];

}

//当ACC OFF时保存里程到EEPROM
//此函数1s运行一次
void SaveDistanceToEEPROM_AccOff()
{
	static uint8 acc_pre = 0;
	uint8 acc;
	
	acc = GetAccState();
	if((acc==0) && (acc_pre==1))
	{
		SaveDistanceToEEPROM(m_uiDistance);
		SaveDistanceToRTCRAM(m_uiDistance);
	}
	acc_pre = acc;
}
#endif
//-----文件GpsInterfaceLayer.c结束---------------------------------------------






















