/*
 * Copyright(c)2020, 江苏徐工信息技术股份有限公司-智能硬件事业部
 * All right reserved
 *
 * 文件名称: GsmHardWareLayer.h
 * 版本号  : V1.0
 * 文件标识:
 * 文件描述: 本文件为GSM模块硬件驱动层的头文件
 *
 *-----------------------------------------------------------------------------
 * 修改历史
 *-----------------------------------------------------------------------------
 *
 * 2019-03-09 by , 创建本文件
 *
 */
 
#ifndef GSMHARDWARELAYER_H_20110609_A228C809_39C9_43EE_87BF_92CE3ACDEB20
#define GSMHARDWARELAYER_H_20110609_A228C809_39C9_43EE_87BF_92CE3ACDEB20

//-----常量定义----------------------------------------------------------------


//-----结构定义----------------------------------------------------------------

//-----外部变量----------------------------------------------------------------

//-----外部函数----------------------------------------------------------------

int WriteGsmUartData(int fd, uint8 *data,int size);

#endif

































