/*
 * Copyright(c)2020, 江苏徐工信息技术股份有限公司-智能硬件事业部
 * All right reserved
 *
 * 文件名称: IAP.h
 * 版本号  : V1.0
 * 文件标识: 
 * 文件描述: 本文件为IAP功能模块远程固件升级处理文件的头文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-16, by lxf, 创建本文件
 *
 */

#ifndef _IAP_H 
#define	_IAP_H 
 
#ifdef _IN_IAP_H_ 
#define	EXT_IAP 
#else 
#define	EXT_IAP extern  
#endif 
 
#define	EMPTY				(0xff) 
 

#define APP_VERSION_SIGN    "/cache/helloworld_bak_ver.txt" 
 
 
 
//-----结构定义----------------------------------------------------------------

/************************************************************************************************ 
**  Public Fuctions Declaration 
*************************************************************************************************/ 


uint8  IAP_Start(void); 


#endif 



