/*
 * Copyright(c)2020, 江苏徐工信息技术股份有限公司-智能硬件事业部
 * All right reserved
 *
 * 文件名称: IAP.c
 * 版本号  : V1.0
 * 文件标识:
 * 文件描述: 本文件为IAP功能模块远程固件升级处理的文件
 *
 *-----------------------------------------------------------------------------
 * 修改记录
 *-----------------------------------------------------------------------------
 *
 * 2019-03-16, by YZJ , 创建本文件
 *
 */
 
   
#define _IN_IAP_H_  

//-----文件头调用--------------------------------------------------------------
#include "config.h"

#include "IAP.h" 


//-----外部变量定义------------------------------------------------------------



//-----内部变量定义------------------------------------------------------------


//-----内部变量定义------------------------------------------------------------
uint8 Version[5];//核心板模块应用程序版本号


//-----内部函数声明------------------------------------------------------------


//-----外部函数定义------------------------------------------------------------


uint8 IAP_Start(void)
{    
   char cmd[128] = {0};

	system("cp -f /data/helloworld_bak /cache/helloworld_bak ");
	system("chmod a+x /cache/helloworld_bak");
		
	sprintf(cmd, "echo %s > %s", Version, APP_VERSION_SIGN);
	system(cmd);	
	system("sync");
    
	PC_SendDebugData((uint8 *)("IAP reboot"), 10, DEBUG_ANYDATA);
	sleep(2);
	system("reboot");
	exit(0);


	return 1;
}


//-----文件IAP.c结束---------------------------------------------

